{
  "architectures": [
    "SwinForPDE"
  ],
  "attention_probs_dropout_prob": 0.0,
  "channel_slice_list_normalized_loss": [
    0,
    1,
    3,
    4
  ],
  "depths": [
    4,
    4,
    4,
    4
  ],
  "drop_path_rate": 0.0,
  "embed_dim": 48,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 384,
  "image_size": 128,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "learn_residual": false,
  "mlp_ratio": 4.0,
  "model_type": "swinv2",
  "num_channels": 4,
  "num_heads": [
    3,
    6,
    12,
    24
  ],
  "num_layers": 4,
  "num_out_channels": 4,
  "p": 1,
  "patch_size": 4,
  "pretrained_window_sizes": [
    0,
    0,
    0,
    0
  ],
  "qkv_bias": true,
  "residual_model": "convnext",
  "skip_connections": [
    2,
    2,
    2,
    0
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "use_absolute_embeddings": false,
  "use_conditioning": true,
  "window_size": 16
}
